[Survived] BlockStatement
source/drivers/config/config.js:7:7
 }, {
   encoding,
   fileName,
-}) => {
-  try {
-    const file = await fs.readFile(fileName, encoding);
-    const loadedConfig = yaml.load(file);
-
-    return [
-      loadedConfig,
-    ];
-  } catch (error) {
-    return [
-      undefined,
-      `load: ${error.message}`,
-    ];
-  }
-};
+}) => {};
 
 const createRegExps = (templates) => {

[Survived] BlockStatement
source/drivers/config/config.js:8:7
   encoding,
   fileName,
 }) => {
-  try {
-    const file = await fs.readFile(fileName, encoding);
-    const loadedConfig = yaml.load(file);
-
-    return [
-      loadedConfig,
-    ];
-  } catch (error) {
+  try {} catch (error) {
     return [
       undefined,

[Survived] ArrayDeclaration
source/drivers/config/config.js:12:12
     const file = await fs.readFile(fileName, encoding);
     const loadedConfig = yaml.load(file);
 
-    return [
-      loadedConfig,
-    ];
+    return [];
   } catch (error) {
     return [

[Survived] BlockStatement
source/drivers/config/config.js:15:19
     return [
       loadedConfig,
     ];
-  } catch (error) {
-    return [
-      undefined,
-      `load: ${error.message}`,
-    ];
-  }
+  } catch (error) {}
 };
 

[Survived] StringLiteral
source/drivers/config/config.js:18:7
   } catch (error) {
     return [
       undefined,
-      `load: ${error.message}`,
+      ``,
     ];
   }

[Survived] BlockStatement
source/drivers/config/config.js:23:38
   }
 };
 
-const createRegExps = (templates) => {
-  try {
-    const checkedTemplates = templates ?? [];
-
-    const regExps = [];
-
-    for (const template of checkedTemplates) {
-      const regExp = new RegExp(template, 'u');
-
-      regExps.push(regExp);
-    }
-
-    return [
-      regExps,
-    ];
-  } catch (error) {
-    return [
-      undefined,
-      `createRegExps: ${error.message}`,
-    ];
-  }
-};
+const createRegExps = (templates) => {};
 
 const config = ({

[Survived] BlockStatement
source/drivers/config/config.js:24:7
 };
 
 const createRegExps = (templates) => {
-  try {
-    const checkedTemplates = templates ?? [];
-
-    const regExps = [];
-
-    for (const template of checkedTemplates) {
-      const regExp = new RegExp(template, 'u');
-
-      regExps.push(regExp);
-    }
-
-    return [
-      regExps,
-    ];
-  } catch (error) {
+  try {} catch (error) {
     return [
       undefined,

[Survived] LogicalOperator
source/drivers/config/config.js:25:30
 
 const createRegExps = (templates) => {
   try {
-    const checkedTemplates = templates ?? [];
+    const checkedTemplates = templates && [];
 
     const regExps = [];

[Survived] ArrayDeclaration
source/drivers/config/config.js:25:43
 
 const createRegExps = (templates) => {
   try {
-    const checkedTemplates = templates ?? [];
+    const checkedTemplates = templates ?? ["Stryker was here"];
 
     const regExps = [];

[Survived] BlockStatement
source/drivers/config/config.js:29:46
 
     const regExps = [];
 
-    for (const template of checkedTemplates) {
-      const regExp = new RegExp(template, 'u');
-
-      regExps.push(regExp);
-    }
+    for (const template of checkedTemplates) {}
 
     return [

[Survived] StringLiteral
source/drivers/config/config.js:30:43
     const regExps = [];
 
     for (const template of checkedTemplates) {
-      const regExp = new RegExp(template, 'u');
+      const regExp = new RegExp(template, "");
 
       regExps.push(regExp);

[Survived] BlockStatement
source/drivers/config/config.js:38:19
     return [
       regExps,
     ];
-  } catch (error) {
-    return [
-      undefined,
-      `createRegExps: ${error.message}`,
-    ];
-  }
+  } catch (error) {}
 };
 

[Survived] StringLiteral
source/drivers/config/config.js:41:7
   } catch (error) {
     return [
       undefined,
-      `createRegExps: ${error.message}`,
+      ``,
     ];
   }

[Survived] BlockStatement
source/drivers/config/config.js:60:22
         yaml,
       }, options);
 
-      if (loadError) {
-        return [
-          undefined,
-          `read: ${loadError}`,
-        ];
-      }
+      if (loadError) {}
 
       const [

[Survived] ConditionalExpression
source/drivers/config/config.js:60:11
         yaml,
       }, options);
 
-      if (loadError) {
+      if (false) {
         return [
           undefined,

[Survived] ArrayDeclaration
source/drivers/config/config.js:61:16
       }, options);
 
       if (loadError) {
-        return [
-          undefined,
-          `read: ${loadError}`,
-        ];
+        return [];
       }
 

[Killed] BlockStatement
source/drivers/config/config.js:71:31
         ignores,
         ignoresRegExpError,
       ] = createRegExps(loadedConfig.ignores);
-      if (ignoresRegExpError) {
-        return [
-          undefined,
-          `read: ${ignoresRegExpError}`,
-        ];
-      }
+      if (ignoresRegExpError) {}
 
       const [
killedBy: All tests
statusReason: > lint-fs@0.1.4 test:unit
> npx c8 ./run-tests.sh; rm -rf ./coverage


node:internal/process/promises:279
            triggerUncaughtException(err, true /* fromPromise */);
            ^

[Survived] ConditionalExpression
source/drivers/config/config.js:71:11
         ignores,
         ignoresRegExpError,
       ] = createRegExps(loadedConfig.ignores);
-      if (ignoresRegExpError) {
+      if (true) {
         return [
           undefined,

[Survived] ArrayDeclaration
source/drivers/config/config.js:72:16
         ignoresRegExpError,
       ] = createRegExps(loadedConfig.ignores);
       if (ignoresRegExpError) {
-        return [
-          undefined,
-          `read: ${ignoresRegExpError}`,
-        ];
+        return [];
       }
 

[Survived] StringLiteral
source/drivers/config/config.js:74:11
       if (ignoresRegExpError) {
         return [
           undefined,
-          `read: ${ignoresRegExpError}`,
+          ``,
         ];
       }

[Survived] ConditionalExpression
source/drivers/config/config.js:82:11
         rules,
         rulesRegExpError,
       ] = createRegExps(loadedConfig.rules);
-      if (rulesRegExpError) {
+      if (false) {
         return [
           undefined,

[Survived] BlockStatement
source/drivers/config/config.js:82:29
         rules,
         rulesRegExpError,
       ] = createRegExps(loadedConfig.rules);
-      if (rulesRegExpError) {
-        return [
-          undefined,
-          `read: ${rulesRegExpError}`,
-        ];
-      }
+      if (rulesRegExpError) {}
 
       return [

[Survived] ArrayDeclaration
source/drivers/config/config.js:89:14
         ];
       }
 
-      return [
-        {
-          ignores,
-          rules,
-        },
-      ];
+      return [];
     },
   };
