[Survived] BlockStatement
source/drivers/drivers.js:6:35
 import filesystem from './filesystem/filesystem.js';
 import logger from './logger/logger.js';
 
-const drivers = (dependencies) => {
-  return {
-    config: config(dependencies),
-    fail,
-    filesystem: filesystem(dependencies),
-    logger: logger(dependencies),
-  };
-};
+const drivers = (dependencies) => {};
 
 export default drivers;

[Survived] ObjectLiteral
source/drivers/drivers.js:7:10
 import logger from './logger/logger.js';
 
 const drivers = (dependencies) => {
-  return {
-    config: config(dependencies),
-    fail,
-    filesystem: filesystem(dependencies),
-    logger: logger(dependencies),
-  };
+  return {};
 };
 
