[Survived] ArrayDeclaration
source/drivers/filesystem/filesystem.js:7:23
   return {
     paths: async (root) => {
       try {
-        const paths = [];
+        const paths = ["Stryker was here"];
         const candidates = [
           root,

[Survived] EqualityOperator
source/drivers/filesystem/filesystem.js:12:29
           root,
         ];
 
-        for (let index = 0; index < candidates.length; index++) {
+        for (let index = 0; index <= candidates.length; index++) {
           const candidate = candidates[index];
 

[Survived] ConditionalExpression
source/drivers/filesystem/filesystem.js:12:29
           root,
         ];
 
-        for (let index = 0; index < candidates.length; index++) {
+        for (let index = 0; false; index++) {
           const candidate = candidates[index];
 

[Survived] ConditionalExpression
source/drivers/filesystem/filesystem.js:17:15
 
           const isDirectory = (await fs.stat(candidate)).isDirectory();
 
-          if (!isDirectory) {
+          if (true) {
             paths.push(candidate);
 

[Survived] ConditionalExpression
source/drivers/filesystem/filesystem.js:17:15
 
           const isDirectory = (await fs.stat(candidate)).isDirectory();
 
-          if (!isDirectory) {
+          if (false) {
             paths.push(candidate);
 

[Survived] BlockStatement
source/drivers/filesystem/filesystem.js:25:54
 
           const files = await fs.readdir(candidate);
 
-          const nextCandidates = files.map((file) => {
-            return `${candidate}/${file}`;
-          });
+          const nextCandidates = files.map((file) => {});
 
           candidates.push(...nextCandidates);

[Survived] ArrayDeclaration
source/drivers/filesystem/filesystem.js:32:16
           candidates.push(...nextCandidates);
         }
 
-        return [
-          paths,
-        ];
+        return [];
       } catch (error) {
         return [

[Survived] BlockStatement
source/drivers/filesystem/filesystem.js:35:23
         return [
           paths,
         ];
-      } catch (error) {
-        return [
-          undefined,
-          `paths: ${error.message}`,
-        ];
-      }
+      } catch (error) {}
     },
   };
