[Survived] BlockStatement
source/drivers/logger/logger.js:1:36
-const log = (format, std, text) => {
-  std.log(format, text);
-};
+const log = (format, std, text) => {};
 
 const logger = ({

[Survived] BlockStatement
source/drivers/logger/logger.js:7:7
 
 const logger = ({
   std,
-}) => {
-  return {
-    log: (format, text) => {
-      log(format, std, text);
-    },
-    logBatch: (format, texts) => {
-      for (const text of texts) {
-        log(format, std, text);
-      }
-    },
-  };
-};
+}) => {};
 
 export default logger;

[Survived] BlockStatement
source/drivers/logger/logger.js:9:28
   std,
 }) => {
   return {
-    log: (format, text) => {
-      log(format, std, text);
-    },
+    log: (format, text) => {},
     logBatch: (format, texts) => {
       for (const text of texts) {

[Survived] BlockStatement
source/drivers/logger/logger.js:12:34
     log: (format, text) => {
       log(format, std, text);
     },
-    logBatch: (format, texts) => {
-      for (const text of texts) {
-        log(format, std, text);
-      }
-    },
+    logBatch: (format, texts) => {},
   };
 };

[Survived] BlockStatement
source/drivers/logger/logger.js:13:33
       log(format, std, text);
     },
     logBatch: (format, texts) => {
-      for (const text of texts) {
-        log(format, std, text);
-      }
+      for (const text of texts) {}
     },
   };
