[Survived] ObjectLiteral
source/source.js:12:13
   fail,
   filesystem,
   logger,
-} = drivers({
-  fs,
-  std: console,
-  yaml,
-});
+} = drivers({});
 
 const [

[Survived] ConditionalExpression
source/source.js:26:5
   filesystem,
   logger,
 }).lintFs();
-if (error) {
+if (true) {
   fail(error);
 }

[Survived] ConditionalExpression
source/source.js:26:5
   filesystem,
   logger,
 }).lintFs();
-if (error) {
+if (false) {
   fail(error);
 }
