[Survived] StringLiteral
source/useCases/lintFs/lintFs.js:21:32
     const [
       paths,
       filesystemError,
-    ] = await filesystem.paths('.');
+    ] = await filesystem.paths("");
 
     if (filesystemError) {

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:23:9
       filesystemError,
     ] = await filesystem.paths('.');
 
-    if (filesystemError) {
+    if (false) {
       return [
         undefined,

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:23:9
       filesystemError,
     ] = await filesystem.paths('.');
 
-    if (filesystemError) {
+    if (true) {
       return [
         undefined,

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:24:14
     ] = await filesystem.paths('.');
 
     if (filesystemError) {
-      return [
-        undefined,
-        `lintFs: ${filesystemError}`,
-      ];
+      return [];
     }
 

[Survived] StringLiteral
source/useCases/lintFs/lintFs.js:26:9
     if (filesystemError) {
       return [
         undefined,
-        `lintFs: ${filesystemError}`,
+        ``,
       ];
     }

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:38:9
       fileName: './lint-fs.yaml',
     });
 
-    if (configError) {
+    if (false) {
       return [
         undefined,

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:38:9
       fileName: './lint-fs.yaml',
     });
 
-    if (configError) {
+    if (true) {
       return [
         undefined,

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:39:14
     });
 
     if (configError) {
-      return [
-        undefined,
-        `lintFs: ${configError}`,
-      ];
+      return [];
     }
 

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:46:23
     }
 
     const correct = [];
-    const incorrect = [];
+    const incorrect = ["Stryker was here"];
 
     const {

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:59:11
         ignoresError,
       ] = matcher.isCorrect(path, ignores);
 
-      if (ignoresError) {
+      if (false) {
         return [
           undefined,

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:59:11
         ignoresError,
       ] = matcher.isCorrect(path, ignores);
 
-      if (ignoresError) {
+      if (true) {
         return [
           undefined,

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:60:16
       ] = matcher.isCorrect(path, ignores);
 
       if (ignoresError) {
-        return [
-          undefined,
-          `lintFs: ${ignoresError}`,
-        ];
+        return [];
       }
 

[Survived] StringLiteral
source/useCases/lintFs/lintFs.js:62:11
       if (ignoresError) {
         return [
           undefined,
-          `lintFs: ${ignoresError}`,
+          ``,
         ];
       }

[Survived] BlockStatement
source/useCases/lintFs/lintFs.js:66:22
         ];
       }
 
-      if (isIgnored) {
-        continue;
-      }
+      if (isIgnored) {}
 
       const [

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:66:11
         ];
       }
 
-      if (isIgnored) {
+      if (false) {
         continue;
       }

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:75:11
         rulesError,
       ] = matcher.isCorrect(path, rules);
 
-      if (rulesError) {
+      if (false) {
         return [
           undefined,

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:75:11
         rulesError,
       ] = matcher.isCorrect(path, rules);
 
-      if (rulesError) {
+      if (true) {
         return [
           undefined,

[Survived] BlockStatement
source/useCases/lintFs/lintFs.js:82:20
         ];
       }
 
-      if (isRuled) {
-        correct.push(path);
-      } else {
+      if (isRuled) {} else {
         incorrect.push(path);
       }

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:82:11
         ];
       }
 
-      if (isRuled) {
+      if (false) {
         correct.push(path);
       } else {

[Survived] BlockStatement
source/useCases/lintFs/lintFs.js:84:14
 
       if (isRuled) {
         correct.push(path);
-      } else {
-        incorrect.push(path);
-      }
+      } else {}
     }
 

[Survived] ObjectLiteral
source/useCases/lintFs/lintFs.js:92:32
     const [
       _,
       reporterError,
-    ] = reporter.print(logger, {
-      correct,
-      incorrect,
-    });
+    ] = reporter.print(logger, {});
 
     if (reporterError) {

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:97:9
       incorrect,
     });
 
-    if (reporterError) {
+    if (false) {
       return [
         undefined,

[Survived] BlockStatement
source/useCases/lintFs/lintFs.js:97:24
       incorrect,
     });
 
-    if (reporterError) {
-      return [
-        undefined,
-        `lintFs: ${reporterError}`,
-      ];
-    }
+    if (reporterError) {}
 
     const isFileSystemIncorrect = incorrect.length > 0;

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:98:14
     });
 
     if (reporterError) {
-      return [
-        undefined,
-        `lintFs: ${reporterError}`,
-      ];
+      return [];
     }
 

[Survived] EqualityOperator
source/useCases/lintFs/lintFs.js:104:35
       ];
     }
 
-    const isFileSystemIncorrect = incorrect.length > 0;
+    const isFileSystemIncorrect = incorrect.length >= 0;
     if (isFileSystemIncorrect) {
       return [

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:104:35
       ];
     }
 
-    const isFileSystemIncorrect = incorrect.length > 0;
+    const isFileSystemIncorrect = true;
     if (isFileSystemIncorrect) {
       return [

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:105:9
     }
 
     const isFileSystemIncorrect = incorrect.length > 0;
-    if (isFileSystemIncorrect) {
+    if (false) {
       return [
         undefined,

[Survived] ConditionalExpression
source/useCases/lintFs/lintFs.js:105:9
     }
 
     const isFileSystemIncorrect = incorrect.length > 0;
-    if (isFileSystemIncorrect) {
+    if (true) {
       return [
         undefined,

[Survived] ArrayDeclaration
source/useCases/lintFs/lintFs.js:112:12
       ];
     }
 
-    return [];
+    return ["Stryker was here"];
   };
 };
