[Survived] BlockStatement
useCases/lintFs/matcher/matcher.js:1:33
-const isOk = (path, regExps) => {
-  let ok = false;
-
-  for (const regExp of regExps) {
-    ok = ok || regExp.test(path);
-
-    if (ok) {
-      break;
-    }
-  }
-
-  return ok;
-};
+const isOk = (path, regExps) => {};
 
 const matcher = {

[Survived] BooleanLiteral
useCases/lintFs/matcher/matcher.js:2:12
 const isOk = (path, regExps) => {
-  let ok = false;
+  let ok = true;
 
   for (const regExp of regExps) {

[Survived] BlockStatement
useCases/lintFs/matcher/matcher.js:4:33
 const isOk = (path, regExps) => {
   let ok = false;
 
-  for (const regExp of regExps) {
-    ok = ok || regExp.test(path);
-
-    if (ok) {
-      break;
-    }
-  }
+  for (const regExp of regExps) {}
 
   return ok;

[Survived] ConditionalExpression
useCases/lintFs/matcher/matcher.js:5:10
   let ok = false;
 
   for (const regExp of regExps) {
-    ok = ok || regExp.test(path);
+    ok = true;
 
     if (ok) {

[Survived] LogicalOperator
useCases/lintFs/matcher/matcher.js:5:10
   let ok = false;
 
   for (const regExp of regExps) {
-    ok = ok || regExp.test(path);
+    ok = ok && regExp.test(path);
 
     if (ok) {

[Survived] ConditionalExpression
useCases/lintFs/matcher/matcher.js:7:9
   for (const regExp of regExps) {
     ok = ok || regExp.test(path);
 
-    if (ok) {
+    if (true) {
       break;
     }

[Survived] BlockStatement
useCases/lintFs/matcher/matcher.js:16:29
 };
 
 const matcher = {
-  isCorrect (path, regExps) {
-    const ok = isOk(path, regExps);
-
-    return [
-      ok,
-    ];
-  },
+  isCorrect (path, regExps) {},
 };
 

[Survived] ArrayDeclaration
useCases/lintFs/matcher/matcher.js:19:12
   isCorrect (path, regExps) {
     const ok = isOk(path, regExps);
 
-    return [
-      ok,
-    ];
+    return [];
   },
 };
