[Survived] BlockStatement
useCases/lintFs/reporter/reporter.js:3:9
 const reporter = {
   print (logger, paths) {
-    try {
-      const {
-        correct,
-        incorrect,
-      } = paths;
-
-      logger.log('\u001B[4m\u001B[36m%s\u001B[0m', 'File System is Linted!📐\n');
-
-      if (correct.length > 0) {
-        logger.log('\u001B[42m%s\u001B[0m', 'Correct Files');
-        logger.logBatch('\u001B[32m%s\u001B[0m', correct);
-      }
-
-      if (incorrect.length > 0) {
-        logger.log('\u001B[37m\u001B[41m%s\u001B[0m', '\nIncorrect Files');
-        logger.logBatch('\u001B[31m%s\u001B[0m', incorrect);
-      }
-
-      return [];
-    } catch (error) {
+    try {} catch (error) {
       return [
         `reporter: ${error.message}`,

[Survived] StringLiteral
useCases/lintFs/reporter/reporter.js:9:52
         incorrect,
       } = paths;
 
-      logger.log('\u001B[4m\u001B[36m%s\u001B[0m', 'File System is Linted!📐\n');
+      logger.log('\u001B[4m\u001B[36m%s\u001B[0m', "";
 
       if (correct.length > 0) {

[Survived] EqualityOperator
useCases/lintFs/reporter/reporter.js:11:11
 
       logger.log('\u001B[4m\u001B[36m%s\u001B[0m', 'File System is Linted!📐\n');
 
-      if (correct.length > 0) {
+      if (correct.length >= 0) {
         logger.log('\u001B[42m%s\u001B[0m', 'Correct Files');
         logger.logBatch('\u001B[32m%s\u001B[0m', correct);

[Survived] ConditionalExpression
useCases/lintFs/reporter/reporter.js:11:11
 
       logger.log('\u001B[4m\u001B[36m%s\u001B[0m', 'File System is Linted!📐\n');
 
-      if (correct.length > 0) {
+      if (true) {
         logger.log('\u001B[42m%s\u001B[0m', 'Correct Files');
         logger.logBatch('\u001B[32m%s\u001B[0m', correct);

[Survived] BlockStatement
useCases/lintFs/reporter/reporter.js:16:33
         logger.logBatch('\u001B[32m%s\u001B[0m', correct);
       }
 
-      if (incorrect.length > 0) {
-        logger.log('\u001B[37m\u001B[41m%s\u001B[0m', '\nIncorrect Files');
-        logger.logBatch('\u001B[31m%s\u001B[0m', incorrect);
-      }
+      if (incorrect.length > 0) {}
 
       return [];

[Survived] EqualityOperator
useCases/lintFs/reporter/reporter.js:16:11
         logger.logBatch('\u001B[32m%s\u001B[0m', correct);
       }
 
-      if (incorrect.length > 0) {
+      if (incorrect.length <= 0) {
         logger.log('\u001B[37m\u001B[41m%s\u001B[0m', '\nIncorrect Files');
         logger.logBatch('\u001B[31m%s\u001B[0m', incorrect);

[Survived] StringLiteral
useCases/lintFs/reporter/reporter.js:17:55
       }
 
       if (incorrect.length > 0) {
-        logger.log('\u001B[37m\u001B[41m%s\u001B[0m', '\nIncorrect Files');
+        logger.log('\u001B[37m\u001B[41m%s\u001B[0m', "");
         logger.logBatch('\u001B[31m%s\u001B[0m', incorrect);
       }

[Survived] BlockStatement
useCases/lintFs/reporter/reporter.js:22:21
       }
 
       return [];
-    } catch (error) {
-      return [
-        `reporter: ${error.message}`,
-      ];
-    }
+    } catch (error) {}
   },
 };
