[Survived] BlockStatement
source/useCases/useCases.js:3:31
 import lintFs from './lintFs/lintFs.js';
 
-const useCases = (drivers) => {
-  return {
-    lintFs: lintFs(drivers),
-  };
-};
+const useCases = (drivers) => {};
 
 export default useCases;
